#include "config.h"

#if CONF_LED_EN


//※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※
// 函数名称  : LED_Init
// 功能描述  : LED初始化
// 输入参数  : None
// 输出参数  : None
// 返回参数  : None
//※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※
void Led_Init(void)
{
GPIO_LED_INIT();
}
//※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※
// 函数名称  : LED_Init
// 功能描述  : LED初始化
// 输入参数  : None
// 输出参数  : None
// 返回参数  : None
//※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※※
void horse_race_lamp(void)
{
LED=!LED;
}

/******************************************************************************/
#endif
/*********************************end of line *********************************/
